Revit 2027 API
ParameterTypeId.ViewGraphSunPath Property
 "Sun Path"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId ViewGraphSunPath { get; }
Public Shared ReadOnly Property ViewGraphSunPath As ForgeTypeId
	Get
public:
static property ForgeTypeId^ ViewGraphSunPath {
	ForgeTypeId^ get ();
}
static member ViewGraphSunPath : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace